
// Возвращает значение константы ФормироватьРезультатЗадачПоДням
Функция ПолучитьФормироватьРезультатЗадачПоДням() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ФормироватьРезультатЗадачПоДням.Получить();
	
КонецФункции

// Возвращает значение константы ОграничиватьКоличествоЗадачВРаботе
Функция ПолучитьОграничиватьКоличествоЗадачВРаботе() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ОграничиватьКоличествоЗадачВРаботе.Получить();
	
КонецФункции

// Возвращает значение константы ИспользоватьАвтоматическуюОчередьЗадач
Функция ПолучитьИспользоватьАвтоматическуюОчередьЗадач() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьАвтоматическуюОчередьЗадач.Получить();
	
КонецФункции

// Возвращает значение константы ИспользоватьУведомленияЗаказчиков
Функция ПолучитьИспользоватьУведомленияЗаказчиков() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьУведомленияЗаказчиков.Получить();
	
КонецФункции

// Возвращает значение константы КоличествоМесяцевДляОпределенияОсновногоИсполнителя
Функция ПолучитьКоличествоМесяцевДляОпределенияОсновногоИсполнителя() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.КоличествоМесяцевДляОпределенияОсновногоИсполнителя.Получить();
	
КонецФункции

