Функция ЗаказчикПоАдресуЭП(АдресЭП, ВключатьПомеченныеНаУдаление = Ложь) Экспорт
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказчикиКонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заказчики.КонтактнаяИнформация КАК ЗаказчикиКонтактнаяИнформация
	|ГДЕ
	|	ЗаказчикиКонтактнаяИнформация.Вид = &Вид
	|	И ЗаказчикиКонтактнаяИнформация.АдресЭП = &АдресЭП
	|{ГДЕ
	|	ЗаказчикиКонтактнаяИнформация.Ссылка.ПометкаУдаления}";
	
	Запрос.Параметры.Вставить("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailЗаказчика"));
	Запрос.Параметры.Вставить("АдресЭП", АдресЭП);
	Если Не ВключатьПомеченныеНаУдаление Тогда
		Запрос.Отбор.Добавить("ПометкаУдаления").Установить(Ложь);
	КонецЕсли;
	
	Выборка = Запрос.Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции