//+++ КИТЭК ЧехловНИ 09.04.2024
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(ЗагружаемыйФайл, ВидЛицензии)

	Документ = Новый ТекстовыйДокумент;
	Документ.Прочитать(ЗагружаемыйФайл);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	СвойстваВидовЛицензий.СвойствоЛицензии КАК СвойствоЛицензии,
	|	СвойстваВидовЛицензий.СвойствоЛицензии.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	РегистрСведений.СвойстваВидовЛицензий КАК СвойстваВидовЛицензий
	|ГДЕ
	|	СвойстваВидовЛицензий.ВидЛицензии = &ВидЛицензии";
	
	Запрос.УстановитьПараметр("ВидЛицензии", ВидЛицензии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗВыборка = РезультатЗапроса.Выгрузить();
	
	Для НомерСтроки = 1 По Документ.КоличествоСтрок() Цикл
		
		Строка = Документ.ПолучитьСтроку(НомерСтроки);
		МассивСлов = СтрРазделить(Строка, ":");
		
		Если МассивСлов.Количество() < 2 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПараметрыОтбораСвойство = Новый Структура;
		ПВХ = ПланыВидовХарактеристик.СвойстваЛицензий.НайтиПоНаименованию(МассивСлов[0]);
		
		Если ПВХ = Неопределено Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		ПараметрыОтбораСвойство.Вставить("Свойство", ПВХ);
		НайденнаяСтрока = Объект.ДанныеЛицензии.НайтиСтроки(ПараметрыОтбораСвойство);	
		
		ПараметрыОтбораТипЗначения = Новый Структура;
		ПараметрыОтбораТипЗначения.Вставить("СвойствоЛицензии", ПВХ);
		
		ЭлементВыборки = ТЗВыборка.НайтиСтроки(ПараметрыОтбораТипЗначения);
						
		Тип = Новый ОписаниеТипов(ЭлементВыборки[0].ТипЗначения);
				
		НайденнаяСтрока[0].Значение = Тип.ПривестиЗначение();
		
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			
			НайденнаяСтрока[0].Значение = МассивСлов[1];	
			
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТЧ (ВидЛицензии)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	СвойстваВидовЛицензий.СвойствоЛицензии КАК СвойствоЛицензии,
	|	СвойстваВидовЛицензий.СвойствоЛицензии.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	РегистрСведений.СвойстваВидовЛицензий КАК СвойстваВидовЛицензий
	|ГДЕ
	|	СвойстваВидовЛицензий.ВидЛицензии = &ВидЛицензии";
	
	Запрос.УстановитьПараметр("ВидЛицензии", ВидЛицензии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить ("Отсутствуют свойства данной лицензии!");
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Объект.ДанныеЛицензии.Добавить();
			НоваяСтрока.Свойство = Выборка.СвойствоЛицензии;
			
			Тип = Новый ОписаниеТипов(Выборка.ТипЗначения);
			
			НоваяСтрока.Значение = Тип.ПривестиЗначение();
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		
		ЗагружаемыйФайл = Диалог.ПолноеИмяФайла;
		
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(ЗагружаемыйФайл, Объект.ВидЛицензиии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЛицензиииПриИзменении(Элемент)
	
	Объект.ДанныеЛицензии.Очистить();
	ЗаполнитьТЧ(Объект.ВидЛицензиии);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры
//--- КИТЭК ЧехловНИ 09.04.2024
