
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Наименование = &Наименование
	|	И Организации.Ссылка <> &Ссылка");
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
		
		Сообщить("Организация с наименованием """ + Наименование + """ уже введена в Информационную базу!");
	КонецЕсли;
	
КонецПроцедуры
