Процедура ОтметитьПрочтенной(Задача) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НепрочитанныеЗадачи.Пользователь,
	|	НепрочитанныеЗадачи.Задача
	|ИЗ
	|	РегистрСведений.НепрочитанныеЗадачи КАК НепрочитанныеЗадачи
	|ГДЕ
	|	НепрочитанныеЗадачи.Пользователь = &Пользователь
	|	И НепрочитанныеЗадачи.Задача = &Задача";
	Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Задача", Задача);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.НепрочитанныеЗадачи.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтметитьНепрочитанной(МассивИсполнительЗаказчик, Задача) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Для каждого Пользователь Из МассивИсполнительЗаказчик Цикл
		Если Не ЗначениеЗаполнено(Пользователь) ИЛИ 
				Не (ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") ИЛИ ТипЗнч(Пользователь) = Тип("СправочникСсылка.ВнешниеПользователи")) Тогда
			Продолжить;
		КонецЕсли;
		Если Пользователь <> ТекущийПользователь Тогда
			Запись = РегистрыСведений.НепрочитанныеЗадачи.СоздатьМенеджерЗаписи();
			Запись.Задача = Задача;
			Запись.Пользователь = Пользователь;
			Запись.ДатаИзменения = ТекущаяДата();
			Запись.Непрочитана = Истина;
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры