
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Количество = Работы.Итог("Количество");
	Сумма = Работы.Итог("Сумма");
	СуммаОплатыЗаказчиком = 0;
	СуммаОплатыИсполнителям = 0;
	Для Каждого СтрокаТЧ Из Оплата Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Дата) Тогда
			Если СтрокаТЧ.Сумма < 0 Тогда
				СуммаОплатыЗаказчиком = СуммаОплатыЗаказчиком - СтрокаТЧ.Сумма;
			ИначеЕсли Не СтрокаТЧ.Исполнитель.Пустая() Тогда
				СуммаОплатыИсполнителям = СуммаОплатыИсполнителям + СтрокаТЧ.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Оплата.Количество() <> 0 Тогда
	РазмерОплаты = 0;
	Движения.ДоходыИсполнителей.Записывать = Истина;
	Для Каждого СтрокаОплаты Из Оплата Цикл

		Если ЗначениеЗаполнено(СтрокаОплаты.Поступление) Тогда
			РазмерОплаты = РазмерОплаты + СтрокаОплаты.Сумма;
		КонецЕсли;

		Если СтрокаОплаты.Дата = '00010101' ИЛИ СтрокаОплаты.Сумма = 0 ИЛИ СтрокаОплаты.Исполнитель.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ДоходыИсполнителей.Добавить();
		Движение.Период = СтрокаОплаты.Дата;
		Движение.Организация = Организация;
		Движение.Исполнитель = СтрокаОплаты.Исполнитель;
		Движение.Заказчик = Заказчик;
		Движение.Сумма = СтрокаОплаты.Сумма;
	КонецЦикла;
	
	Движения.кт_УчтенныеЗадачи.Записывать = Истина;
	Движения.УчетТрудозатрат.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы Из Работы Цикл
		ДвижениеУЗ = Движения.кт_УчтенныеЗадачи.Добавить();
		ДвижениеУЗ.Период = Дата;
		ДвижениеУЗ.Задача = ТекСтрокаРаботы.Задача;

		ДвижениеУТ = Движения.УчетТрудозатрат.Добавить();
		ДвижениеУТ.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеУТ.Период = Дата;
		ДвижениеУТ.Заявка = ТекСтрокаРаботы.Задача;
		ДвижениеУТ.Заказчик = Заказчик;
		ДвижениеУТ.Проект = ТекСтрокаРаботы.Проект; 
		ДвижениеУТ.Трудоемкость = ТекСтрокаРаботы.КоличествоФактическое;
		ДвижениеУТ.Продолжительность = ТекСтрокаРаботы.Количество;
		ДвижениеУТ.Сумма = ТекСтрокаРаботы.Сумма;
	КонецЦикла;
	
		
	Движения.Задолженность.Записывать = Истина;
	Движение = Движения.Задолженность.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиент = Заказчик;
	Движение.Документ = Ссылка;
	Движение.СуммаДляАкта = РазмерОплаты;
	
	КонецЕсли;

	Движения.УчетТрудозатрат.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы Из Работы Цикл
		ДвижениеУТ = Движения.УчетТрудозатрат.Добавить();
		ДвижениеУТ.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеУТ.Период = Дата;
		ДвижениеУТ.Заявка = ТекСтрокаРаботы.Задача;
		ДвижениеУТ.Заказчик = Заказчик;
		ДвижениеУТ.Проект = ТекСтрокаРаботы.Проект; 
		ДвижениеУТ.Трудоемкость = ТекСтрокаРаботы.КоличествоФактическое;
		ДвижениеУТ.Продолжительность = ТекСтрокаРаботы.Количество;
		ДвижениеУТ.Сумма = ТекСтрокаРаботы.Сумма;
	КонецЦикла;

	Движения.ТрудозатратыПланФактические.Записывать = Истина;
	Движение = Движения.ТрудозатратыПланФактические.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Заказчик;
	Движение.Документ = Ссылка;
	Движение.ЧасыФактические = Работы.Итог("КоличествоФактическое");	
	Движение.ЧасыПлановые = Работы.Итог("Количество");
	Движение.СуммаФактическая = СуммаКорректируемая;
	
	Движения.Задолженность.Записывать = Истина;
	Движение = Движения.Задолженность.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Заказчик;
	Движение.Документ = Ссылка;
	Движение.СуммаДляАкта = СуммаКорректируемая;
	
КонецПроцедуры



