
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Количество = Работы.Итог("Количество");
	Сумма = Работы.Итог("Сумма");
	СуммаОплатыЗаказчиком = 0;
	СуммаОплатыИсполнителям = 0;
	Для Каждого СтрокаТЧ Из Оплата Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Дата) Тогда
			Если СтрокаТЧ.Сумма < 0 Тогда
				СуммаОплатыЗаказчиком = СуммаОплатыЗаказчиком - СтрокаТЧ.Сумма;
			ИначеЕсли Не СтрокаТЧ.Исполнитель.Пустая() Тогда
				СуммаОплатыИсполнителям = СуммаОплатыИсполнителям + СтрокаТЧ.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Оплата.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ДоходыИсполнителей.Записывать = Истина;
	Для Каждого СтрокаОплаты Из Оплата Цикл
		Если СтрокаОплаты.Дата = '00010101' ИЛИ СтрокаОплаты.Сумма = 0 ИЛИ СтрокаОплаты.Исполнитель.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ДоходыИсполнителей.Добавить();
		Движение.Период = СтрокаОплаты.Дата;
		Движение.Организация = Организация;
		Движение.Исполнитель = СтрокаОплаты.Исполнитель;
		Движение.Заказчик = Заказчик;
		Движение.Сумма = СтрокаОплаты.Сумма;
	КонецЦикла;
	
	Движения.кт_УчтенныеЗадачи.Записывать = Истина;
	Движения.УчетТрудозатрат.Записывать = Истина;
	Для Каждого ТекСтрокаРаботы Из Работы Цикл
		ДвижениеУЗ = Движения.кт_УчтенныеЗадачи.Добавить();
		ДвижениеУЗ.Период = Дата;
		ДвижениеУЗ.Задача = ТекСтрокаРаботы.Задача;

		ДвижениеУТ = Движения.УчетТрудозатрат.Добавить();
		ДвижениеУТ.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеУТ.Период = Дата;
		ДвижениеУТ.Заявка = ТекСтрокаРаботы.Задача;
		ДвижениеУТ.Заказчик = Заказчик;
		ДвижениеУТ.Проект = ТекСтрокаРаботы.Проект; 
		ДвижениеУТ.Трудоемкость = ТекСтрокаРаботы.КоличествоФактическое;
		ДвижениеУТ.Продолжительность = ТекСтрокаРаботы.Количество;
		ДвижениеУТ.Сумма = ТекСтрокаРаботы.Сумма;
	КонецЦикла;

//	Движения.УчетТрудозатрат.Записывать = Истина;
//	Для Каждого Движение = Движения.УчетТрудозатрат.Добавить();
//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//	Движение.Период = Дата;
//	Движение.Заявка = Ссылка;
//	Движение.Заказчик = Заказчик;
//	Движение.Трудоемкость = Работы.Итог("КоличествоФактическое");
//	Движение.Продолжительность = Работы.Итог("Количество");
//	Движение.Сумма = Работы.Итог("Сумма");
		
КонецПроцедуры



