
&ИзменениеИКонтроль("ПолныйПутьТома")
Функция s3_ПолныйПутьТома(СсылкаНаТом)

	#Вставка
	Если s3_API.ЭтоТипХранилища_ОбъектноеS3(СсылкаНаТом) Тогда
		Возврат s3_API.ПолныйПутьТома(СсылкаНаТом);
	КонецЕсли;
	#КонецВставки
	СистемнаяИнфо = Новый СистемнаяИнформация;
	ТипПлатформыСервера = СистемнаяИнфо.ТипПлатформы;

	УстановитьПривилегированныйРежим(Истина);
	Если ТипПлатформыСервера = ТипПлатформы.Windows_x86
		Или ТипПлатформыСервера = ТипПлатформы.Windows_x86_64 Тогда

		Возврат СсылкаНаТом.ПолныйПутьWindows;
	Иначе
		Возврат СсылкаНаТом.ПолныйПутьLinux;
	КонецЕсли;

КонецФункции
