
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоПараметру") Тогда
		//Установка отбора по параметру
		ИмяРеквизита = "";
		Если ТипЗнч(Параметры.ОтборПоПараметру) = Тип("СправочникСсылка.АвтоматизацияУсловия") Тогда
			ИмяРеквизита = "Команды.Условие";
		ИначеЕсли ТипЗнч(Параметры.ОтборПоПараметру) = Тип("СправочникСсылка.АвтоматизацияКоманды") Тогда
			ИмяРеквизита = "Команды.Команда";
		КонецЕсли;
		Если Не ПустаяСтрока(ИмяРеквизита) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.Список, ИмяРеквизита, Параметры.ОтборПоПараметру, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Параметры.ОтборПоПараметру));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
