&НаКлиенте
Процедура ПриОткрытии()
    // Задаем начальные значения для редактируемых полей
    ЭтаФорма.Адрес.Значение = "10.0.0.11";
    ЭтаФорма.Порт.Значение = 8201;
    ЭтаФорма.Токен.Значение = "hvs.Ge9wLBNp4XjzX0InkoE5aYIS";
КонецПроцедуры

&НаКлиенте
Процедура КнопкаИнициализироватьХранилищеНажатие(Кнопка)
    Если ИнициализироватьХранилищеVault() Тогда
        Сообщить("Хранилище успешно инициализировано.");
    Иначе
        Сообщить("Ошибка инициализации хранилища.");
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИнициализироватьХранилищеVault() Экспорт

    Адрес = "http://10.0.0.11:8201"; 
    Путь = "/v1/sys/init";           
	КоличествоКлючей = 3;            
	ПорогКлючей = 2;                 
    ТелоЗапроса = Новый Структура;
    ТелоЗапроса.Вставить("secret_shares", КоличествоКлючей);
    ТелоЗапроса.Вставить("secret_threshold", ПорогКлючей);

    Соединение = Новый HTTPСоединение(Адрес);
    Запрос = Новый HTTPЗапрос;
    Запрос.УстановитьМетод("POST");
    Запрос.УстановитьПуть(Путь);
    Запрос.УстановитьЗаголовок("Content-Type", "application/json");
    Запрос.УстановитьТелоJSON(ТелоЗапроса);
    
    Ответ = Соединение.Отправить(Запрос);

    Если Ответ.КодСостояния = 200 Тогда
        // Обработка успешного ответа
        ОтветJSON = Ответ.ПолучитьТелоКакСтроку();
        Сообщить("Ответ от Vault: " + ОтветJSON);
        Возврат Истина;
    Иначе
        // Обработка ошибки
        Сообщить("Ошибка инициализации: " + Ответ.КодСостояния + " " + Ответ.Сообщение);
        Возврат Ложь;
    КонецЕсли;
КонецФункции
