
&ИзменениеИКонтроль("ДвоичныеДанныеФайла")
Функция s3_ДвоичныеДанныеФайла(Знач ПрисоединенныйФайл)

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("РаботаСФайлами.ДвоичныеДанныеФайла", "ПрисоединенныйФайл", 
	ПрисоединенныйФайл, Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип);

	УстановитьПривилегированныйРежим(Истина);

	ФайлОбъект = РаботаСФайламиСлужебный.ФайлОбъект(ПрисоединенныйФайл);

	Если ФайлОбъект.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвоичныеДанныеФайлов.Файл,
		|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла
		|ИЗ
		|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		|ГДЕ
		|	ДвоичныеДанныеФайлов.Файл = &ПрисоединенныйФайл";

		Запрос.УстановитьПараметр("ПрисоединенныйФайл", ФайлОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Возврат Выборка.ДвоичныеДанныеФайла.Получить();
		КонецЕсли;

		// Запись в журнал регистрации.
		СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Двоичные данные файла отсутствуют в регистре ДвоичныеДанныеФайла
		|
		|Ссылка на файл: ""%1"".'"),
		ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Файлы.Открытие файла'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники[ПрисоединенныйФайл.Метаданные().Имя],
		ПрисоединенныйФайл,
		СообщениеОбОшибке);

		ПредставлениеВладельцаФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Присоединен к %1 : %2'"),
		Строка(ТипЗнч(ФайлОбъект.ВладелецФайла)),
		ФайлОбъект.ВладелецФайла);

		ВызватьИсключение РаботаСФайламиСлужебныйКлиентСервер.ОшибкаФайлНеНайденВХранилищеФайлов(
		ФайлОбъект.Наименование + "." + ФайлОбъект.Расширение,
		Ложь,
		ПредставлениеВладельцаФайла);
	Иначе
		ПолныйПуть = РаботаСФайламиСлужебный.ПолныйПутьТома(ФайлОбъект.Том) + ФайлОбъект.ПутьКФайлу;

		Попытка
			#Удаление
			Возврат Новый ДвоичныеДанные(ПолныйПуть);
			#КонецУдаления
			#Вставка
			Возврат s3_API.ПолучитьДвоичныеДанныеФайла(ФайлОбъект.Том, ПолныйПуть);
			#КонецВставки
		Исключение
			// Запись в журнал регистрации.
			СообщениеОбОшибке = ТекстОшибкиПриПолученииФайла(ИнформацияОбОшибке(), ПрисоединенныйФайл);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Файлы.Получение файла из тома'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники[ПрисоединенныйФайл.Метаданные().Имя],
			ПрисоединенныйФайл,
			СообщениеОбОшибке);

			ПредставлениеВладельцаФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Присоединен к %1 : %2'"),
			Строка(ТипЗнч(ФайлОбъект.ВладелецФайла)),
			ФайлОбъект.ВладелецФайла);

			ВызватьИсключение РаботаСФайламиСлужебныйКлиентСервер.ОшибкаФайлНеНайденВХранилищеФайлов(
			ФайлОбъект.Наименование + "." + ФайлОбъект.Расширение,
			,
			ПредставлениеВладельцаФайла);

		КонецПопытки;
	КонецЕсли;

КонецФункции
