
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОткрытьФормуЗадачи = Параметры.ОткрытьФормуЗадачи;
	Если ОткрытьФормуЗадачи Тогда
		
		ПараметрыОтбора = Новый Структура("Ключ, Значение");
		ИмяРеквизита = "Исполнитель";
		Значение = Новый Массив;
		Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
		Если  ТипЗнч(Пользователь) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
			ИмяРеквизита = "Заказчик";
			Значение.Добавить(Пользователь.ОбъектАвторизации.Владелец);
		Иначе
			Значение.Добавить(Пользователь);
			Значение.Добавить(Справочники.Пользователи.ПустаяСсылка());
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ИмяРеквизита, Значение,,,,
				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ОткрытьФормуЗадачи Тогда
		Заголовок = "Выберите шаблон для создания задачи";
		АвтоЗаголовок = Ложь;
	КонецЕсли;
КонецПроцедуры


