
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Если Параметры.МножественныйВыбор <> Неопределено Тогда
		Элементы.Список.МножественныйВыбор = Параметры.МножественныйВыбор;
	КонецЕсли;
	
	//Отбор по заказчику
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма.Список, "ОсновнойЗаказчик", Параметры.Заказчик, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Параметры.Заказчик));
	
КонецПроцедуры