&НаКлиенте
Процедура КнопкаПроверитьНажатие(Команда)
    URL = "/v1/sys/seal-status";
    Соединение = Новый HTTPСоединение("10.0.0.11", 8201);
    
    Заголовки = Новый Соответствие();
    Заголовки.Вставить("X-Vault-Token", "hvs.2ymKnuqhLW6eaWSnWUe6PAzZ");

    HTTPЗапрос = Новый HTTPЗапрос(URL, Заголовки);
    
    Попытка
        Ответ = Соединение.ВызватьHTTPМетод("GET", HTTPЗапрос);

        Если Ответ.КодСостояния = 200 Тогда
            ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
            
            Если Найти(ТелоОтвета, """sealed"":true") <> 0 Тогда
                Сообщить("Хранилище запечатано. Открываю форму для ввода ключа.");
                ОткрытьФормуВводаКлюча();
            Иначе
                Сообщить("Хранилище открыто и готово к работе.");
            КонецЕсли;

        Иначе
            Сообщить("Ошибка запроса: " + Ответ.КодСостояния);
        КонецЕсли;
    Исключение
        Сообщить("Ошибка выполнения запроса: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВводаКлюча()
    ФормаВвода = ОткрытьФорму("ОбщаяФорма.ФормаРаспечаткиХранилища");
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗапечататьНажатие(Команда)
    URL = "/v1/sys/seal";
    Соединение = Новый HTTPСоединение("10.0.0.11", 8201);
    
    Заголовки = Новый Соответствие();
    Заголовки.Вставить("X-Vault-Token", "hvs.2ymKnuqhLW6eaWSnWUe6PAzZ");

    HTTPЗапрос = Новый HTTPЗапрос(URL, Заголовки);
    
    Попытка
        Ответ = Соединение.ВызватьHTTPМетод("PUT", HTTPЗапрос);

        Если Ответ.КодСостояния = 204 Тогда
            Сообщить("Хранилище успешно запечатано.");
        Иначе
            Сообщить("Ошибка запечатывания: " + Ответ.КодСостояния);
        КонецЕсли;
    Исключение
        Сообщить("Ошибка выполнения запроса: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьСекретыНажатие(Команда)
    ОткрытьФорму("ОбщаяФорма.ФормаДобавленияСекрета");
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПолучитьСекретНажатие(Команда)
    ОткрытьФорму("ОбщаяФорма.ФормаПолученияСекретов"); 
КонецПроцедуры
