#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

КонецПроцедуры

#КонецОбласти

// Возвращает текст шаблона письма
//РеквизитыШаблона - структура с ключами ТипТекстаПисьма, Ссылка, ТемаПисьма, ТекстШаблонаПисьма, ТекстШаблонаПисьмаHTML, Кодировка
Функция ПолучитьПредставлениеСодержанияШаблона(РеквизитыШаблона, СозданиеHTML = Ложь) Экспорт
	
	ТекстHTML = "";
	
	Если РеквизитыШаблона.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.HTML 
		И Не ПустаяСтрока(РеквизитыШаблона.ТекстШаблонаПисьмаHTML) Тогда
		
		ТекстHTML = РеквизитыШаблона.ТекстШаблонаПисьмаHTML;
		РаботаС_HTML.ДобавитьТегиКСсылкам(ТекстHTML);
		
		РаботаС_HTML.ПрименитьНастройкиОтображениеПисьма(ТекстHTML);
		
	ИначеЕсли ЗначениеЗаполнено(РеквизитыШаблона.ТекстШаблонаПисьма) Тогда  
			
		ТекстHTML = РеквизитыШаблона.ТекстШаблонаПисьма;
		
	КонецЕсли;
	
	Возврат ТекстHTML;
	
КонецФункции

