// Возвращает текст, сформированный из указанного шаблона
//Предмет - объект из которого необходимо получить поля
Функция ПолучитьТекстШаблона(Шаблон, Предмет = Неопределено) Экспорт
	
	Если ТипЗнч(Шаблон) = Тип("СправочникСсылка.ШаблоныТекстов") Тогда 
		ТекстШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон, "Шаблон");
	Иначе 
		ТекстШаблона = Шаблон;
	КонецЕсли;
	
	// Дата
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекстШаблона = СтрЗаменить(ТекстШаблона, "[День]", Формат(ТекущаяДата, "ДФ=дд"));
	ТекстШаблона = СтрЗаменить(ТекстШаблона, "[Месяц]", Формат(ТекущаяДата, "ДФ=ММ"));
	ТекстШаблона = СтрЗаменить(ТекстШаблона, "[Год]", Формат(ТекущаяДата, "ДФ=гггг"));
	
	// Время
	ТекстШаблона = СтрЗаменить(ТекстШаблона, "[Час]", Формат(ТекущаяДата, "ДФ=ЧЧ"));
	ТекстШаблона = СтрЗаменить(ТекстШаблона, "[Минута]", Формат(ТекущаяДата, "ДФ=мм"));
	
	//Заполнение указанных полей
	Если Предмет <> Неопределено Тогда
		ТекстШаблона = ШаблоныТекстовСлужебный.СформироватьСообщение(Шаблон, Предмет, ТекстШаблона);
	КонецЕсли;
	
	Возврат ТекстШаблона;
	
КонецФункции

