
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	А = 1;
КонецПроцедуры

Функция ЭтоСтатусВыполненойЗадачи(Статус) Экспорт
	Возврат Статус = Перечисления.СтатусыЗадач.Завершена
			ИЛИ Статус = Перечисления.СтатусыЗадач.Отменена
			ИЛИ Статус = Перечисления.СтатусыЗадач.Подтверждение;
КонецФункции

Функция ЭтоСтатусЗакрытойЗадачи(Статус) Экспорт
	Возврат Статус = Перечисления.СтатусыЗадач.Завершена
			ИЛИ Статус = Перечисления.СтатусыЗадач.Отменена;
КонецФункции

Функция ЭтоСтатусОткрытойЗадачи(Статус) Экспорт
	Возврат Статус <> Перечисления.СтатусыЗадач.Завершена
			И Статус <> Перечисления.СтатусыЗадач.Отменена;
КонецФункции
