
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
    Объект = Новый COMОбъект("htmlfile");
    Объект.ParentWindow.ClipboardData.Setdata("Text", ПолучитьТекстЗадачи(ПараметрКоманды));
	
	Состояние("Копирование в буфер",,"Задача "+ПараметрКоманды+" скопирована в оперативную память.", БиблиотекаКартинок.БуферОбмена);
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗадачи(Задача)
	
	Возврат Задача.Наименование + Символы.ПС
		+ "Заказчик: " + Задача.Заказчик + Символы.ПС
		+ "Проект: " + Задача.Проект + Символы.ПС
		+ "Контактное лицо: " + Задача.КонтактноеЛицоЗаказчика + Символы.ПС
		+ Задача.Описание;
	
КонецФункции