
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") Тогда 	
		Элементы.СрокХраненияЗаписейЖурнала.Видимость = Истина;
		СрокХраненияЗаписейЖурнала = Константы.АвтоматизацияСрокХраненияЗаписейЖурнала.Получить();
	Иначе
		Элементы.СрокХраненияЗаписейЖурнала.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СрокХраненияЗаписейЖурналаПриИзменении(Элемент)
	
	СрокХраненияЗаписейЖурналаПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СрокХраненияЗаписейЖурналаПриИзмененииНаСервере()
	
	Константы.АвтоматизацияСрокХраненияЗаписейЖурнала.Установить(СрокХраненияЗаписейЖурнала);
	
КонецПроцедуры


