&НаКлиенте
Процедура КнопкаСохранитьНажатие(Команда)
    Если ПустаяСтрока(ПолеКлюча) Или ПустаяСтрока(ПолеЗначения) Тогда
        Сообщить("Ключ или значение не заполнены. Операция отменена.");
        Возврат;
    КонецЕсли;
    
    // Вызов серверной процедуры через общий модуль
    СохранитьСекрет(ПолеКлюча, ПолеЗначения);
    Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(КодВозврата)
    Если КодВозврата <> 0 Тогда
        Сообщить("Ошибка при закрытии формы.");
    КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура СохранитьСекрет(ПолеКлюча, ПолеЗначения)
    URL = "/v1/secret/" + ПолеКлюча;
    Соединение = Новый HTTPСоединение("10.0.0.11", 8201);
    Заголовки = Новый Соответствие();
    Заголовки.Вставить("X-Vault-Token", "hvs.Ge9wLBNp4XjzX0InkoE5aYIS");
    Заголовки.Вставить("Content-Type", "application/json");

    // Формирование JSON-данных для отправки
    Данные = "{""data"": {""key1"": """ + ПолеЗначения + """}}";
    
    HTTPЗапрос = Новый HTTPЗапрос(URL, Заголовки);
    HTTPЗапрос.УстановитьТелоИзСтроки(Данные, "UTF-8");

    Попытка
        Ответ = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);

        Сообщить("Код ответа: " + Ответ.КодСостояния);
        Сообщить("Тело ответа: " + Ответ.ПолучитьТелоКакСтроку());
        Если Ответ.КодСостояния = 200 Тогда
            Сообщить("Секрет успешно сохранён.");
        Иначе
            Сообщить("Ошибка при сохранении секрета: " + Ответ.КодСостояния + " " + Ответ.ПолучитьТелоКакСтроку());
        КонецЕсли;

    Исключение
        Сообщить("Ошибка выполнения запроса: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры
