Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
    ВидДоступа.Имя = "Проекты";
    ВидДоступа.Представление = НСтр("ru = 'Группы проектов'");
    ВидДоступа.ТипЗначений = Тип("СправочникСсылка.Проекты");
    ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПроекты");	
	
	ВидДоступа = ВидыДоступа.Добавить();
    ВидДоступа.Имя = "Заказчики";
    ВидДоступа.Представление = НСтр("ru = 'Группы заказчиков'");
    ВидДоступа.ТипЗначений = Тип("СправочникСсылка.Заказчики");
    ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаЗаказчики");	
	
КонецПроцедуры

Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// Профиль "Базовые права".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "1f6bc613-9464-11e6-ab01-ac9e174b586a";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Базовые права'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСУЗ");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Исполнитель".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "54c5c59c-9469-11e6-ab01-ac9e174b586a";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Исполнитель'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКалендаряСотрудника");
	ОписаниеПрофиля.Роли.Добавить("ОбработкаОбратныхВызововOAuth2");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрДоски");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрИсполнителей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрПроектов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеЗадач");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеЗаказчиков");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеШаблоновЗадач");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Заказчики");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	//// Профиль "Открытие внешних отчетов и обработок".
	//ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	//ОписаниеПрофиля.Идентификатор = "1b3472f6-4d87-11e6-8264-5404a6a6895d";
	//ОписаниеПрофиля.Наименование  =
	//	НСтр("ru = 'Открытие внешних отчетов и обработок'",
	//		Метаданные.ОсновнойЯзык.КодЯзыка);
	//ОписаниеПрофиля.Описание =
	//	НСтр("ru = ''",
	//		Метаданные.ОсновнойЯзык.КодЯзыка);
	//ОписаниеПрофиля.Роли.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок");
	//ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Редактирование исполнителей и проектов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "54c5c59d-9469-11e6-ab01-ac9e174b586a";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Редактирование исполнителей и проектов'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("РедактированиеИсполнителей");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПроектов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеГруппыДоступаПроекты");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеГруппыДоступаЗаказчики");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Учет".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "54c5c59f-9469-11e6-ab01-ac9e174b586a";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Учет трудозатрат'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("РедактированиеУчетаФинансов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Работа с почтой".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "54c5c59e-9469-11e6-ab01-ac9e174b587a";
	ОписаниеПрофиля.Наименование  =
		НСтр("ru = 'Работа со встроенной электронной почтой'",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''",
			Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("РаботаСоВстроеннойЭлектроннойПочтой");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Заказчик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "54c5c59e-9469-11e6-ab01-ac9e174b586a";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Заказчик'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание = НСтр("ru = 'Используется для внешних пользователей'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("ПросмотрДоски");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеЗадачВнешнимиПользователями");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");

	ОписаниеПрофиля.Назначение.Добавить(Тип("СправочникСсылка.КонтактныеЛицаЗаказчиков"));
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Заказчики");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Заказчик (доп. права)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "54c5c59e-9469-11e6-ab01-ac9e174b588a";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Заказчик (дополнительные возможности)'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Описание = НСтр("ru = 'Используется для внешних пользователей'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("ДополнительныеВозможностиВнешнихПользователей");

	ОписаниеПрофиля.Назначение.Добавить(Тип("СправочникСсылка.КонтактныеЛицаЗаказчиков"));
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Заказчики");
	ОписаниеПрофиля.Описание = "Добавление и редактирование контактных лиц, проектов заказчика, возможность закрытия задач.";
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
    Если ВидДоступа = "Проекты" ИЛИ ВидДоступа = "Заказчики" Тогда
        Использование = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Документ.Задачи.Чтение.Проекты
	|Документ.Задачи.Чтение.Заказчики
	|Документ.Задачи.Изменение.Проекты
	|Документ.Задачи.Изменение.Заказчики
	|Документ.Трудозатраты.Чтение.Заказчики
	|Документ.Трудозатраты.Изменение.Заказчики
	|Справочник.Проекты.Чтение.Проекты
	|Справочник.Проекты.Чтение.Заказчики
	|Справочник.Проекты.Изменение.Проекты
	|Справочник.Проекты.Изменение.Заказчики
	|Справочник.Заказчики.Чтение.Заказчики
	|Справочник.Заказчики.Изменение.Заказчики
	|Справочник.ШаблоныЗадач.Чтение.Заказчики
	|Справочник.ШаблоныЗадач.Чтение.Проекты
	|Справочник.ШаблоныЗадач.Изменение.Заказчики
	|Справочник.ШаблоныЗадач.Изменение.Проекты
	|РегистрСведений.ЧасовыеСтавкиЗадач.Чтение.Заказчики
	|РегистрСведений.ЧасовыеСтавкиЗадач.Чтение.Проекты
	|РегистрСведений.ЧасовыеСтавкиЗадач.Изменение.Заказчики
	|РегистрСведений.ЧасовыеСтавкиЗадач.Изменение.Проекты
	|";
	
КонецПроцедуры
